Case: How to multiply all columns in a dataframe and the results as a new column?

### Pandas version

In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame()
df['A'] = [3.2, 3., 5., 80., 77.]
df['B'] = [3.4, 3., 5., 75., 90.]
df['C'] = [3., 4., 5., 65., 70.]
df.head()

      A     B     C
0   3.2   3.4   3.0
1   3.0   3.0   4.0
2   5.0   5.0   5.0
3  80.0  75.0  65.0
4  77.0  90.0  70.0

In [5]:
df['D'] = df['A']*df['B']*df['C']
df.head()

      A     B     C          D
0   3.2   3.4   3.0      32.64
1   3.0   3.0   4.0      36.00
2   5.0   5.0   5.0     125.00
3  80.0  75.0  65.0  390000.00
4  77.0  90.0  70.0  485100.00

### Dask Version

In [6]:
import dask.dataframe as dd

In [7]:
ddf = dd.from_pandas(df, npartitions=1)

In [8]:
ddf.head()

      A     B     C          D
0   3.2   3.4   3.0      32.64
1   3.0   3.0   4.0      36.00
2   5.0   5.0   5.0     125.00
3  80.0  75.0  65.0  390000.00
4  77.0  90.0  70.0  485100.00

In [9]:
ddf['D'] = ddf['A']*ddf['B']*ddf['C']

In [10]:
ddf.head()

      A     B     C          D
0   3.2   3.4   3.0      32.64
1   3.0   3.0   4.0      36.00
2   5.0   5.0   5.0     125.00
3  80.0  75.0  65.0  390000.00
4  77.0  90.0  70.0  485100.00